[
  {
    "id": 1,
    "name": "Sarah Johnson",
    "photo": "https://randomuser.me/api/portraits/women/32.jpg",
    "specialization": "Corporate Law",
    "status": "online",
    "bio": "Sarah Johnson is a corporate lawyer with over 15 years of experience advising multinational corporations on mergers and acquisitions, corporate governance, and securities law. She has worked on numerous high-profile cases and has been recognized as a leading lawyer in corporate law by several prestigious legal publications.",
    "experience": 15,
    "languages": ["English", "French", "Spanish"],
    "rating": 4.8,
    "reviews": 127,
    "hourlyRate": "$250"
  },
  {
    "id": 2,
    "name": "Michael Chen",
    "photo": "https://randomuser.me/api/portraits/men/42.jpg",
    "specialization": "Family Law",
    "status": "offline",
    "bio": "Michael Chen specializes in family law matters including divorce, child custody, and spousal support. With a compassionate approach and deep understanding of family dynamics, Michael has helped hundreds of clients navigate difficult transitions in their lives. He is committed to finding amicable solutions when possible and fighting for his clients' rights when necessary.",
    "experience": 8,
    "languages": ["English", "Mandarin"],
    "rating": 4.7,
    "reviews": 89,
    "hourlyRate": "$200"
  },
  {
    "id": 3,
    "name": "Jessica Rodriguez",
    "photo": "https://randomuser.me/api/portraits/women/47.jpg",
    "specialization": "Intellectual Property",
    "status": "online",
    "bio": "Jessica Rodriguez is an intellectual property lawyer who specializes in patent, trademark, and copyright law. With a background in computer science, she has a unique understanding of the technical aspects of intellectual property in the digital age. Jessica has helped numerous startups and established companies protect their intellectual assets and navigate complex IP litigation.",
    "experience": 12,
    "languages": ["English", "Spanish"],
    "rating": 4.9,
    "reviews": 102,
    "hourlyRate": "$275"
  },
  {
    "id": 4,
    "name": "David Williams",
    "photo": "https://randomuser.me/api/portraits/men/18.jpg",
    "specialization": "Criminal Law",
    "status": "online",
    "bio": "David Williams is a criminal defense attorney with extensive experience representing clients in cases ranging from misdemeanors to serious felonies. A former prosecutor, David brings unique insights to his defense strategies. He is known for his thorough preparation, aggressive courtroom advocacy, and commitment to protecting his clients' constitutional rights.",
    "experience": 20,
    "languages": ["English"],
    "rating": 4.6,
    "reviews": 156,
    "hourlyRate": "$300"
  },
  {
    "id": 5,
    "name": "Emily Patel",
    "photo": "https://randomuser.me/api/portraits/women/56.jpg",
    "specialization": "Immigration Law",
    "status": "offline",
    "bio": "Emily Patel focuses on immigration law, helping individuals and families navigate the complex U.S. immigration system. She handles a wide range of immigration matters, including family-based petitions, employment visas, asylum applications, and removal defense. Emily is passionate about reuniting families and helping clients achieve their American dreams.",
    "experience": 10,
    "languages": ["English", "Hindi", "Gujarati"],
    "rating": 4.9,
    "reviews": 74,
    "hourlyRate": "$225"
  },
  {
    "id": 6,
    "name": "Robert Johnson",
    "photo": "https://randomuser.me/api/portraits/men/33.jpg",
    "specialization": "Real Estate Law",
    "status": "online",
    "bio": "Robert Johnson specializes in real estate law, handling residential and commercial property transactions, lease agreements, zoning issues, and property disputes. With a background in finance, Robert provides comprehensive legal advice that considers both the legal and financial aspects of real estate matters.",
    "experience": 18,
    "languages": ["English"],
    "rating": 4.7,
    "reviews": 95,
    "hourlyRate": "$275"
  },
  {
    "id": 7,
    "name": "Maria Gonzalez",
    "photo": "https://randomuser.me/api/portraits/women/22.jpg",
    "specialization": "Employment Law",
    "status": "online",
    "bio": "Maria Gonzalez is an employment law specialist with expertise in workplace discrimination, harassment, wrongful termination, and wage disputes. She represents both employees and employers, giving her a balanced perspective on employment law matters. Maria is known for her strategic approach to negotiation and litigation.",
    "experience": 14,
    "languages": ["English", "Spanish", "Portuguese"],
    "rating": 4.8,
    "reviews": 113,
    "hourlyRate": "$265"
  },
  {
    "id": 8,
    "name": "James Wilson",
    "photo": "https://randomuser.me/api/portraits/men/55.jpg",
    "specialization": "Tax Law",
    "status": "offline",
    "bio": "James Wilson is a tax attorney who assists individuals and businesses with tax planning, compliance, and resolution of tax controversies. With a background as a certified public accountant, James offers valuable insights that combine accounting and legal expertise. He specializes in complex tax issues for high-net-worth individuals and multinational corporations.",
    "experience": 22,
    "languages": ["English"],
    "rating": 4.9,
    "reviews": 87,
    "hourlyRate": "$325"
  },
  {
    "id": 9,
    "name": "Sophia Kim",
    "photo": "https://randomuser.me/api/portraits/women/62.jpg",
    "specialization": "Bankruptcy Law",
    "status": "online",
    "bio": "Sophia Kim specializes in bankruptcy law, helping individuals and businesses navigate financial distress and debt restructuring. She provides guidance on Chapter 7, Chapter 11, and Chapter 13 bankruptcy filings and develops strategies for debt management and financial recovery. Sophia is committed to helping clients achieve a fresh financial start.",
    "experience": 9,
    "languages": ["English", "Korean"],
    "rating": 4.7,
    "reviews": 68,
    "hourlyRate": "$240"
  },
  {
    "id": 10,
    "name": "Alexander Thompson",
    "photo": "https://randomuser.me/api/portraits/men/67.jpg",
    "specialization": "Environmental Law",
    "status": "online",
    "bio": "Alexander Thompson is an environmental lawyer who represents clients in matters related to environmental compliance, permitting, litigation, and policy. With a background in environmental science, he brings technical knowledge to his legal practice. Alexander works with businesses, non-profits, and government agencies to address complex environmental challenges.",
    "experience": 16,
    "languages": ["English", "German"],
    "rating": 4.8,
    "reviews": 93,
    "hourlyRate": "$285"
  },
  {
    "id": 11,
    "name": "Olivia Martinez",
    "photo": "https://randomuser.me/api/portraits/women/71.jpg",
    "specialization": "Personal Injury",
    "status": "offline",
    "bio": "Olivia Martinez is a personal injury attorney who advocates for clients who have been injured due to the negligence of others. She handles cases involving car accidents, slip and falls, medical malpractice, and product liability. Olivia is known for her compassionate client service and aggressive representation in pursuit of fair compensation.",
    "experience": 11,
    "languages": ["English", "Spanish"],
    "rating": 4.9,
    "reviews": 142,
    "hourlyRate": "$230"
  },
  {
    "id": 12,
    "name": "Benjamin Lee",
    "photo": "https://randomuser.me/api/portraits/men/72.jpg",
    "specialization": "Healthcare Law",
    "status": "online",
    "bio": "Benjamin Lee specializes in healthcare law, advising healthcare providers, institutions, and companies on regulatory compliance, risk management, and business operations. With experience as a former hospital administrator, Benjamin understands the practical challenges facing healthcare organizations. He helps clients navigate the complex intersection of healthcare and law.",
    "experience": 13,
    "languages": ["English", "Korean"],
    "rating": 4.7,
    "reviews": 85,
    "hourlyRate": "$270"
  },
  {
    "id": 13,
    "name": "Amara Jackson",
    "photo": "https://randomuser.me/api/portraits/women/83.jpg",
    "specialization": "Civil Rights",
    "status": "online",
    "bio": "Amara Jackson is a civil rights attorney committed to protecting the constitutional rights of individuals. She handles cases involving discrimination, police misconduct, voting rights, and First Amendment issues. Amara previously worked for a national civil rights organization and brings that experience to her private practice, where she continues to fight for justice and equality.",
    "experience": 15,
    "languages": ["English"],
    "rating": 4.9,
    "reviews": 110,
    "hourlyRate": "$260"
  },
  {
    "id": 14,
    "name": "Daniel Cohen",
    "photo": "https://randomuser.me/api/portraits/men/83.jpg",
    "specialization": "Entertainment Law",
    "status": "offline",
    "bio": "Daniel Cohen is an entertainment lawyer who represents clients in the music, film, television, and digital media industries. He handles contract negotiations, intellectual property matters, and business transactions for artists, producers, and entertainment companies. Daniel's industry connections and business acumen make him a valuable advocate for creative professionals.",
    "experience": 17,
    "languages": ["English", "Hebrew"],
    "rating": 4.8,
    "reviews": 98,
    "hourlyRate": "$295"
  },
  {
    "id": 15,
    "name": "Priya Sharma",
    "photo": "https://randomuser.me/api/portraits/women/91.jpg",
    "specialization": "International Law",
    "status": "online",
    "bio": "Priya Sharma practices international law, with expertise in cross-border transactions, trade agreements, and international dispute resolution. She advises multinational corporations, governments, and international organizations on complex global legal matters. Priya's multicultural background and language skills make her particularly effective in navigating international legal environments.",
    "experience": 19,
    "languages": ["English", "Hindi", "French", "Arabic"],
    "rating": 4.9,
    "reviews": 121,
    "hourlyRate": "$310"
  },
  {
    "id": 16,
    "name": "Thomas Anderson",
    "photo": "https://randomuser.me/api/portraits/men/91.jpg",
    "specialization": "Education Law",
    "status": "online",
    "bio": "Thomas Anderson specializes in education law, representing students, parents, teachers, and educational institutions. He handles matters related to special education, student rights, teacher employment, and school governance. As a former educator, Thomas brings valuable insights to his legal practice and is passionate about ensuring access to quality education for all students.",
    "experience": 10,
    "languages": ["English"],
    "rating": 4.6,
    "reviews": 78,
    "hourlyRate": "$235"
  },
  {
    "id": 17,
    "name": "Zoe Campbell",
    "photo": "https://randomuser.me/api/portraits/women/14.jpg",
    "specialization": "Elder Law",
    "status": "offline",
    "bio": "Zoe Campbell practices elder law, helping seniors and their families with estate planning, long-term care planning, guardianship, and protection from elder abuse. She is dedicated to ensuring that older adults maintain their dignity, independence, and financial security. Zoe takes a holistic approach to elder law, addressing both legal and social concerns of her clients.",
    "experience": 12,
    "languages": ["English"],
    "rating": 4.9,
    "reviews": 89,
    "hourlyRate": "$245"
  },
  {
    "id": 18,
    "name": "Marcus Washington",
    "photo": "https://randomuser.me/api/portraits/men/23.jpg",
    "specialization": "Sports Law",
    "status": "online",
    "bio": "Marcus Washington is a sports attorney who represents athletes, coaches, teams, and sports organizations. He handles contract negotiations, endorsement deals, regulatory compliance, and dispute resolution in the sports industry. As a former collegiate athlete, Marcus understands the unique challenges facing sports professionals and works to protect their interests and advance their careers.",
    "experience": 14,
    "languages": ["English"],
    "rating": 4.8,
    "reviews": 102,
    "hourlyRate": "$280"
  },
  {
    "id": 19,
    "name": "Leila Nguyen",
    "photo": "https://randomuser.me/api/portraits/women/37.jpg",
    "specialization": "Immigration Law",
    "status": "online",
    "bio": "Leila Nguyen specializes in immigration law, assisting individuals and families with visa applications, permanent residency, citizenship, and deportation defense. As an immigrant herself, Leila brings personal understanding to her legal practice. She is known for her thorough case preparation and compassionate client service during what can be a stressful legal process.",
    "experience": 9,
    "languages": ["English", "Vietnamese", "French"],
    "rating": 4.9,
    "reviews": 115,
    "hourlyRate": "$230"
  },
  {
    "id": 20,
    "name": "Jonathan Rivera",
    "photo": "https://randomuser.me/api/portraits/men/44.jpg",
    "specialization": "Technology Law",
    "status": "online",
    "bio": "Jonathan Rivera is a technology lawyer who advises clients on legal issues related to software, data privacy, e-commerce, and emerging technologies like artificial intelligence and blockchain. With a background in computer engineering, Jonathan bridges the gap between technology and law. He helps startups and established tech companies navigate the rapidly evolving legal landscape.",
    "experience": 11,
    "languages": ["English", "Spanish"],
    "rating": 4.8,
    "reviews": 94,
    "hourlyRate": "$290"
  }
]